*** レコードを定義する

Elixirでのレコード定義は

#+begin_src elixir
  defmodule Records do
    require Record
    Record.defrecord :robot, [
      name: nil,
      type: :industrial,
      hobbies: nil,
      details: []
    ]

    def first_robot do
      robot(name: "Mechatron",
            type: :handmade,
            details: ["Moved by a small man inside"])
    end
  end

  Records.first_robot
  # => {:robot, "Mechatron", :handmade, nil, ["Moved by a small man inside"]}
#+end_src

Erlangとの違い

- Erlangのレコード定義では値を設定しない場合，暗黙的に =:undefined= になる．Elixirからのレコード定義はKey-Valueを受け取るので，構文上「値を設定しない」ということができない．明示的に値へ =:undefined= を設定することはできる．
- ErlangのrrはElixirには無いようだ
  - rrのようにKey-Valueで値を得るには =Record.robot(レコード)= とする
  - =defrecord= の第二引数にはモジュール名を指定できる

#+begin_src elixir
  defmodule Records do
    require Record
    Record.defrecord :robot, Robot, [
      name: nil,
      type: :industrial,
      hobbies: nil,
      details: []
    ]

    def first_robot do
      robot(name: "Mechatron",
            type: :handmade,
            details: ["Moved by a small man inside"])
    end

    def car_factory(corp_name) do
      robot(name: corp_name, hobbies: "building cars")
    end
  end

  defmodule Main do
    require Records

    def run do
      Records.robot(Records.first_robot)
    end
  end

  Records.first_robot
  # => {Robot, "Mechatron", :handmade, nil, ["Moved by a small man inside"]}

  Records.car_factory("Jokeswagen")
  # => {Robot, "Jokeswagen", :industrial, "building cars", []}

  Main.run
  # => [name: "Mechatron", type: :handmade, hobbies: nil,
  #     details: ["Moved by a small man inside"]]
#+end_src

#+RESULTS:
| name: | Mechatron | type: | :handmade | hobbies: | nil | details: | (Moved by a small man inside) |

